# inf

https://inf-ege.sdamgia.ru/?redir=1
<br>
Использовались материалы https://github.com/romanrakhlin/ege-informatics


| Номер | Тема | Описание |
| :---------- | :------------- | :------------ |
| 1 💚 | Графики | PowerPoint |
| [2 💚](https://github.com/voron5096/inf/blob/main/ege/2.md) | Построить по формуле | Функция`print('y z w x')` задаётся выражением, когда истинно, ложно |
| 3 💚 | Базы Данных | Excel |
| 4 💛 | Условия фано | PowerPoint |
| [5 💛](https://github.com/voron5096/inf/blob/main/ege/5.py) | `N -> R` | Алгоритм получает на вход Исполнитель из 10-тичной в 2-ичную. На вход подаётся число N... |
| [6 💚](https://github.com/voron5096/inf/blob/main/ege/6.py) | Скопировать код | (s ==) Определите, при каком наименьшем наибольшем программа выведет |
| [7 💛](https://github.com/voron5096/inf/blob/main/ege/7.md) | Рисунки КБайты`I = k * i`  | Автоматическая фотокамера |
| [8 💛](https://github.com/voron5096/inf/blob/main/ege/8.py) | Составление слов | `import itertools`, И.В.А.Н |
| [9 💛](https://github.com/voron5096/inf/blob/main/ege/9.md) | Температура | Excel |
| 10 💚 | Поиск | Ctrl + F |
| [11 💛](https://github.com/voron5096/inf/blob/main/ege/11.md) | Пароли  | `$ # @ ^ &` 26 букв алфавита, сколько выделено на доп. сведения |
| [12 💚](https://github.com/voron5096/inf/blob/main/ege/12.py) | Замена строчек | `s.replace('43', '33', 1)` `s = '4' * 30 + '5'` Какая строка получится в результате  |
| 13 💚 | Графики 2 | PowerPoint
| [14 💚](https://github.com/voron5096/inf/blob/main/ege/14.py) | Сколько нулей | `value = 16 ** 442 + 4 ** 191 - 2 ** 226 - 22` записали в СС с основанием 9 сколько 8 содержится в этой записи? |
| [15 ❤](https://github.com/voron5096/inf/blob/main/ege/15.md) | `Дел(a,9) ^ (Дел (280,x)` | Для какого наименьшего неотрицательного целого числа А, принимает значение 1  |
| [16 💚](https://github.com/voron5096/inf/blob/main/ege/16.py) | Скопировать код | Рекурсия`F(n)` if n == 1 return 0 Найдите f(12) |
| [17 💛](https://github.com/voron5096/inf/blob/main/ege/17.py) | Последовательность | Excel, [1233;123123] Найдите количество и минимальное из них |
| [18 💚](https://github.com/voron5096/inf/blob/main/ege/18.py) | Робот | Excel |
| [19 ❤](https://github.com/voron5096/inf/blob/main/ege/19.py) | Кучи камней | Петя и Вася, Excel, сложный код |
| [20 ❤](https://github.com/voron5096/inf/blob/main/ege/19.md) | Кучи камней | Петя и Вася, Excel, сложный код |
| [21 ❤](https://github.com/voron5096/inf/blob/main/ege/19.md) | Кучи камней | Петя и Вася, Excel, сложный код |
| [22 💚](https://github.com/voron5096/inf/blob/main/ege/22.py) | Скопировать код | `a == 1 and b == 3` Ниже записана программа, определите...  |
| [23 💛](https://github.com/voron5096/inf/blob/main/ege/23.py) | Исполнитель 2 команды | Excel, кол-во программ,`make(x, y)` |
| [24 💛](https://github.com/voron5096/inf/blob/main/ege/24.py) | Файл XYZ | 1 строка, или несколько строк файлов |
| [25 💚](https://github.com/voron5096/inf/blob/main/ege/25.py) | Вложенные циклы | НОД, [234525;784625] `for j in range(i + 1, N)` |
| [26 ❤](https://github.com/voron5096/inf/blob/main/ege/26.py) | Разные задачи | Excel |
| [27](https://github.com/voron5096/inf/blob/main/ege/27.py) | | |

# CC

http://numconvert.ru/100


| 10 | 2     | 3   | 4   | 8  | 12 | 16 |
| :--- | :------ | :---- | :---- | :--- | :--- | :--- |
| 1  | 1     | 1   | 1   | 1  | 1  | 1  |
| 2  | 10    | 2   | 2   | 2  | 2  | 2  |
| 3  | 11    | 10  | 3   | 3  | 3  | 3  |
| 4  | 100   | 11  | 10  | 4  | 4  | 4  |
| 5  | 101   | 12  | 11  | 5  | 5  | 5  |
| 6  | 110   | 20  | 12  | 6  | 6  | 6  |
| 7  | 111   | 21  | 13  | 7  | 7  | 7  |
| 8  | 1000  | 22  | 20  | 10 | 8  | 8  |
| 9  | 1001  | 100 | 21  | 11 | 9  | 9  |
| 10 | 1010  | 101 | 22  | 12 | A  | A  |
| 11 | 1011  | 102 | 23  | 13 | B  | B  |
| 12 | 1100  | 110 | 30  | 14 | 10 | C  |
| 13 | 1101  | 111 | 31  | 15 | 11 | D  |
| 14 | 1110  | 112 | 32  | 16 | 12 | E  |
| 15 | 1111  | 120 | 33  | 17 | 13 | F  |
| 16 | 10000 | 121 | 100 | 20 | 14 | 10 |
| 17 | 10001 | 122 | 101 | 21 | 15 | 11 |
| 18 | 10010 | 200 | 102 | 22 | 16 | 12 |
| 19 | 10011 | 201 | 103 | 23 | 17 | 13 |
| 20 | 10100 | 202 | 110 | 24 | 18 | 14 |
